### Data encoding is the process in which we can convert categorical value into meaningfull numerical values so that computer can understand

They are basically 3 types :-
1. Nominal or One Hot Encoding
2. Level and Ordinal Encoding
3. Target guided original Encoding

In [1]:
## Nominal encoding
import pandas as pd
from sklearn.preprocessing import OneHotEncoder

In [2]:
## create a simple dataframe
df=pd.DataFrame(
    {
        'colour':['red','blue','green','green','red','blue']
    }
)

In [3]:
df.head()

  colour
0    red
1   blue
2  green
3  green
4    red

In [4]:
## create an instance of onehotencoder
encoder=OneHotEncoder()

In [7]:
## perform fit and then transform
encoded=encoder.fit_transform(df[['colour']]).toarray()

In [8]:
encoder_df=pd.DataFrame(encoded,columns=encoder.get_feature_names_out())

In [9]:
encoder_df

   colour_blue  colour_green  colour_red
0          0.0           0.0         1.0
1          1.0           0.0         0.0
2          0.0           1.0         0.0
3          0.0           1.0         0.0
4          0.0           0.0         1.0
5          1.0           0.0         0.0

In [11]:
## for new data
encoder.transform([['blue']]).toarray()

d:\Machine Learning\venv\Lib\site-packages\sklearn\utils\validation.py:2739: UserWarning: X does not have valid feature names, but OneHotEncoder was fitted with feature names
  warnings.warn(

array([[1., 0., 0.]])

In [12]:
pd.concat([df,encoder_df],axis=1)

  colour  colour_blue  colour_green  colour_red
0    red          0.0           0.0         1.0
1   blue          1.0           0.0         0.0
2  green          0.0           1.0         0.0
3  green          0.0           1.0         0.0
4    red          0.0           0.0         1.0
5   blue          1.0           0.0         0.0

In [13]:
import seaborn as sns
sns.load_dataset('tips')

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

## label encoding

In [14]:
df.head()

  colour
0    red
1   blue
2  green
3  green
4    red

In [15]:
from sklearn.preprocessing import LabelEncoder

In [18]:
lbl_encoder=LabelEncoder() ## creating an instance

In [19]:
lbl_encoder.fit_transform(df[['colour']])

d:\Machine Learning\venv\Lib\site-packages\sklearn\preprocessing\_label.py:110: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

array([2, 0, 1, 1, 2, 0])

In [20]:
lbl_encoder.transform([['red']])

d:\Machine Learning\venv\Lib\site-packages\sklearn\preprocessing\_label.py:129: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, dtype=self.classes_.dtype, warn=True)

array([2])

In [21]:
lbl_encoder.transform([['blue']])

d:\Machine Learning\venv\Lib\site-packages\sklearn\preprocessing\_label.py:129: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, dtype=self.classes_.dtype, warn=True)

array([0])

In [22]:
lbl_encoder.transform([['green']])

d:\Machine Learning\venv\Lib\site-packages\sklearn\preprocessing\_label.py:129: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, dtype=self.classes_.dtype, warn=True)

array([1])

## Ordinal Encoding

In [23]:
from sklearn.preprocessing import OrdinalEncoder

In [25]:
df=pd.DataFrame(
    {
        'size':['small','medium','large','medium','small','large']
    }
)

In [26]:
df

     size
0   small
1  medium
2   large
3  medium
4   small
5   large

In [27]:
ord_encoder=OrdinalEncoder(categories=[['small','medium','large']]) ## create an instance and then fit_transform

In [28]:
ord_encoder.fit_transform(df[['size']])

array([[0.],
       [1.],
       [2.],
       [1.],
       [0.],
       [2.]])

### target guided Ordinal Encoding

In [29]:
df=pd.DataFrame(
    {
        'city':['New York','London','Paris','Tokyo','New York','Paris'],
        'price':[200,150,300,250,180,320]
    }
)

In [30]:
df

       city  price
0  New York    200
1    London    150
2     Paris    300
3     Tokyo    250
4  New York    180
5     Paris    320

In [32]:
mean_price=df.groupby('city')['price'].mean().to_dict()

In [33]:
mean_price

{'London': 150.0, 'New York': 190.0, 'Paris': 310.0, 'Tokyo': 250.0}

In [34]:
df['city_encoded']=df['city'].map(mean_price)

In [37]:
df[['price','city_encoded']]

   price  city_encoded
0    200         190.0
1    150         150.0
2    300         310.0
3    250         250.0
4    180         190.0
5    320         310.0

In [35]:
df

       city  price  city_encoded
0  New York    200         190.0
1    London    150         150.0
2     Paris    300         310.0
3     Tokyo    250         250.0
4  New York    180         190.0
5     Paris    320         310.0

In [41]:
df1=sns.load_dataset('tips')

In [43]:
mean_bill=df1.groupby('time')['total_bill'].mean().to_dict()

C:\Users\ayang\AppData\Local\Temp\ipykernel_12948\595542940.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  mean_bill=df1.groupby('time')['total_bill'].mean().to_dict()

In [44]:
df1['bill_encoded']=df1['time'].map(mean_bill)

In [46]:
df1

     total_bill   tip     sex smoker   day    time  size bill_encoded
0         16.99  1.01  Female     No   Sun  Dinner     2    20.797159
1         10.34  1.66    Male     No   Sun  Dinner     3    20.797159
2         21.01  3.50    Male     No   Sun  Dinner     3    20.797159
3         23.68  3.31    Male     No   Sun  Dinner     2    20.797159
4         24.59  3.61  Female     No   Sun  Dinner     4    20.797159
..          ...   ...     ...    ...   ...     ...   ...          ...
239       29.03  5.92    Male     No   Sat  Dinner     3    20.797159
240       27.18  2.00  Female    Yes   Sat  Dinner     2    20.797159
241       22.67  2.00    Male    Yes   Sat  Dinner     2    20.797159
242       17.82  1.75    Male     No   Sat  Dinner     2    20.797159
243       18.78  3.00  Female     No  Thur  Dinner     2    20.797159

[244 rows x 8 columns]